/*В книгах о Шерлоке Холмсе используются единицы измерения английской системы мер (а именно английские футы и дюймы). Из-за этого непонятно, кто высокий, а кто не очень. Напишите программу, переводящую футы и дюймы в метры и сантиметры.
Входные данные:
Два натуральных числа. Первое, FF, количество футов, второе, DD, количество дюймов.
Выходные данные:
Строка, содеражащая вещественное число, равное количеству метров в FF футах и DD дюймах. Формат числа: два знака после запятой.*/

#include <stdio.h>

int main ()
{
    double F, D, result;
    scanf ("%lf %lf", &F, &D);
    
    result = (F * 12 + D)*25.4 / 1000;
    printf("%.0lf'%.0lf\" = %.2lfm.", F, D, result);
    return 0;
}
